# ************************************************************
# Sequel Ace SQL dump
# 版本號： 20109
#
# https://sequel-ace.com/
# https://github.com/Sequel-Ace/Sequel-Ace
#
# 主機: 127.0.0.1 (MySQL 8.0.46)
# 資料庫: resource
# 產生時間: 2026-09-01 22:53:05 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
SET NAMES utf8mb4;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE='NO_AUTO_VALUE_ON_ZERO', SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# 傾印（Dump）資料表 tx-admin_users
# ------------------------------------------------------------

DROP TABLE IF EXISTS `tx-admin_users`;

CREATE TABLE `tx-admin_users` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `password` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`),
  KEY `da` (`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

LOCK TABLES `tx-admin_users` WRITE;
/*!40000 ALTER TABLE `tx-admin_users` DISABLE KEYS */;

INSERT INTO `tx-admin_users` (`id`, `name`, `password`, `created_at`, `updated_at`, `deleted_at`)
VALUES
	(1,'admin','55b764578f3e645474b770f25ed9eab0','2026-08-08 01:20:25','2026-08-08 01:20:25','2038-01-19 03:14:07');

/*!40000 ALTER TABLE `tx-admin_users` ENABLE KEYS */;
UNLOCK TABLES;


# 傾印（Dump）資料表 tx-app_users
# ------------------------------------------------------------

DROP TABLE IF EXISTS `tx-app_users`;

CREATE TABLE `tx-app_users` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `password` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`),
  KEY `da` (`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

LOCK TABLES `tx-app_users` WRITE;
/*!40000 ALTER TABLE `tx-app_users` DISABLE KEYS */;

INSERT INTO `tx-app_users` (`id`, `name`, `password`, `created_at`, `updated_at`, `deleted_at`)
VALUES
	(1,'app','95c9fd7b3e519cd6123451438b910fb7','2026-08-23 02:57:20','2026-08-23 03:01:32','2038-01-19 03:14:07');

/*!40000 ALTER TABLE `tx-app_users` ENABLE KEYS */;
UNLOCK TABLES;


# 傾印（Dump）資料表 tx-game_types
# ------------------------------------------------------------

DROP TABLE IF EXISTS `tx-game_types`;

CREATE TABLE `tx-game_types` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `parent_id` int unsigned DEFAULT '0',
  `key` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  PRIMARY KEY (`id`),
  UNIQUE KEY `k` (`key`),
  KEY `n-da` (`name`,`deleted_at`),
  KEY `da` (`deleted_at`),
  KEY `gti-da` (`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

LOCK TABLES `tx-game_types` WRITE;
/*!40000 ALTER TABLE `tx-game_types` DISABLE KEYS */;

INSERT INTO `tx-game_types` (`id`, `parent_id`, `key`, `name`, `created_at`, `updated_at`, `deleted_at`)
VALUES
	(1,0,'POKER','撲克牌類','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(2,0,'BACCARAT','百家樂類','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(3,0,'ROULETTE','輪盤類','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(4,0,'DICE','骰子類','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(5,0,'PAIGOW','牌九類','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(6,0,'NUMBERS','號碼賓果類','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(7,0,'TRADITIONAL','中式傳統類','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(8,1,'POKER-TEXAS_HOLDEM','德州撲克','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(9,1,'POKER-OMAHA','奧馬哈撲克','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(10,1,'POKER-SEVEN_CARD_STUD','七張梭哈','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(11,1,'POKER-THREE_CARDS','三公','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(12,1,'POKER-GOLDEN_FLOWER','詐金花','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(13,2,'BACCARAT-CLASSIC_BACCARAT','經典百家樂','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(14,2,'BACCARAT-NO_COMMISSION_BACCARAT','免佣百家樂','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(15,2,'BACCARAT-DRAGON_BONUS_BACCARAT','龍寶百家樂','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(16,2,'BACCARAT-SPEED_BACCARAT','極速百家樂','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(17,2,'BACCARAT-MINI_BACCARAT','迷你百家樂','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(18,3,'ROULETTE-EUROPEAN_ROULETTE','歐洲輪盤','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(19,3,'ROULETTE-AMERICAN_ROULETTE','美式輪盤','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(20,3,'ROULETTE-FRENCH_ROULETTE','法式輪盤','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(21,3,'ROULETTE-SPEED_ROULETTE','極速輪盤','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(22,3,'ROULETTE-LIGHTNING_ROULETTE','閃電輪盤','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(23,4,'DICE-SIC_BO','一般骰寶','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(24,4,'DICE-FISH_PRAWN_CRAB','魚蝦蟹','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(25,4,'DICE-FORTUNE','幸運骰寶','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(26,4,'DICE-DICE_BIG_SMALL','猜大小','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(27,4,'DICE-QUICK_THREE','快三','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(28,4,'DICE-DICE_CUP','色盅','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(29,5,'PAIGOW-PAI_GOW','牌九','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(30,5,'PAIGOW-PUSH_TUBE','推筒子','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(31,5,'PAIGOW-TIN_GOW','天九','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(32,5,'PAIGOW-DOMINO','骨牌','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(33,6,'NUMBERS-BINGO','賓果','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(34,6,'NUMBERS-KENO','基諾','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(35,6,'NUMBERS-LOTTO','樂透彩','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(36,6,'NUMBERS-LUCKY_WHEEL','幸運轉盤','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(37,6,'NUMBERS-QUICK_LOTTO','快樂彩','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(38,7,'TRADITIONAL-THIRTEEN_CARDS','十三張','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(39,7,'TRADITIONAL-FIGHT_LANDLORD','鬥地主','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(40,7,'TRADITIONAL-GRAB_BULL','搶莊牛牛','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(41,7,'TRADITIONAL-MAHJONG','麻將','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07'),
	(42,7,'TRADITIONAL-TWENTY_EIGHT','二八槓','2026-01-01 09:00:00','2026-01-01 09:00:00','2038-01-19 03:14:07');

/*!40000 ALTER TABLE `tx-game_types` ENABLE KEYS */;
UNLOCK TABLES;


# 傾印（Dump）資料表 tx-games
# ------------------------------------------------------------

DROP TABLE IF EXISTS `tx-games`;

CREATE TABLE `tx-games` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `game_type_id` int unsigned NOT NULL,
  `key` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `description` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  PRIMARY KEY (`id`),
  UNIQUE KEY `k` (`key`),
  KEY `da` (`deleted_at`),
  KEY `gti-da` (`game_type_id`,`deleted_at`),
  KEY `n-da` (`name`,`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

LOCK TABLES `tx-games` WRITE;
/*!40000 ALTER TABLE `tx-games` DISABLE KEYS */;

INSERT INTO `tx-games` (`id`, `game_type_id`, `key`, `name`, `description`, `created_at`, `updated_at`, `deleted_at`)
VALUES
	(1,2,'baccarat','百家樂','比較莊閒兩方點數大小的經典賭桌遊戲','2026-01-01 11:00:00','2026-08-17 04:25:49','2026-08-17 04:25:50'),
	(2,2,'luckysix','幸運六百家樂','百家樂變體，莊家六點獲勝享特別賠率','2026-01-01 13:00:00','2026-08-17 04:25:56','2026-08-17 04:25:57'),
	(3,2,'dragontiger','龍虎','比較龍虎兩張牌點數大小，玩法簡單快速','2026-01-01 15:00:00','2026-08-17 04:26:15','2026-08-17 04:26:15'),
	(4,3,'roulette','歐式輪盤','37 格輪盤，單一 0，猜號碼或範圍下注','2026-01-01 17:00:00','2026-01-01 17:00:00','2038-01-19 03:14:07'),
	(5,3,'amrroulette','美式輪盤','38 格輪盤，含 0 與 00 兩個綠格','2026-01-01 19:00:00','2026-01-01 19:00:00','2038-01-19 03:14:07'),
	(6,4,'sicbo','骰寶','三顆骰子搖出點數組合下注大小單雙','2026-01-01 21:00:00','2026-01-01 21:00:00','2038-01-19 03:14:07'),
	(7,1,'blackjack','21點','牌面總和逼近 21 點但不超過即獲勝','2026-01-01 23:00:00','2026-01-01 23:00:00','2038-01-19 03:14:07'),
	(8,1,'freeblackjack','免佣21點','21點變體，莊家不額外抽佣金','2026-01-02 01:00:00','2026-01-02 01:00:00','2038-01-19 03:14:07'),
	(9,1,'texasholdem','德州撲克','兩張底牌加五張公共牌組合最大牌型','2026-01-02 03:00:00','2026-01-02 03:00:00','2038-01-19 03:14:07'),
	(10,1,'caribbeanstud','加勒比撲克','玩家與莊家比牌型大小的撲克遊戲','2026-01-02 05:00:00','2026-01-02 05:00:00','2038-01-19 03:14:07'),
	(11,1,'threecardpoker','三張牌撲克','僅用三張牌比大小的快速撲克玩法','2026-01-02 07:00:00','2026-01-02 07:00:00','2038-01-19 03:14:07'),
	(12,5,'paigow','牌九','傳統骨牌遊戲，比較牌組大小組合','2026-01-02 09:00:00','2026-01-02 09:00:00','2038-01-19 03:14:07'),
	(13,5,'paigowpoker','牌九撲克','用撲克牌玩法改編的牌九遊戲','2026-01-02 11:00:00','2026-01-02 11:00:00','2038-01-19 03:14:07'),
	(14,7,'fantan','番攤','傳統猜點數餘數的中式賭桌遊戲','2026-01-02 13:00:00','2026-01-02 13:00:00','2038-01-19 03:14:07'),
	(15,1,'niuniu','牛牛','五張牌湊十比牛比大小的撲克玩法','2026-01-02 15:00:00','2026-01-02 15:00:00','2038-01-19 03:14:07'),
	(16,1,'zhajinhua','炸金花','三張牌比牌型大小的撲克玩法','2026-01-02 17:00:00','2026-01-02 17:00:00','2038-01-19 03:14:07'),
	(17,1,'studpoker','梭哈','五張牌比牌型大小，可加注詐唬的撲克玩法','2026-01-02 19:00:00','2026-01-02 19:00:00','2038-01-19 03:14:07'),
	(18,4,'craps','花旗骰','雙骰擲點下注輸贏的美式賭桌遊戲','2026-01-02 21:00:00','2026-01-02 21:00:00','2038-01-19 03:14:07'),
	(19,3,'bigsixwheel','幸運輪','大轉輪指針停留區域決定輸贏','2026-01-02 23:00:00','2026-01-02 23:00:00','2038-01-19 03:14:07'),
	(20,1,'bigtwo','鋤大D','比大小的撲克桌遊，出牌型別多樣','2026-01-03 01:00:00','2026-01-03 01:00:00','2038-01-19 03:14:07'),
	(21,1,'pusoy','十三張','十三張牌分三墩比牌型大小','2026-01-03 03:00:00','2026-01-03 03:00:00','2038-01-19 03:14:07'),
	(22,1,'doupai','鬥牛','五張牌湊十配對比點數大小的桌遊','2026-01-03 05:00:00','2026-01-03 05:00:00','2038-01-19 03:14:07'),
	(23,2,'speedbaccarat','極速百家樂','更快節奏的百家樂，每局時間縮短','2026-01-03 07:00:00','2026-01-03 07:00:00','2038-01-19 03:14:07'),
	(24,2,'nocommission','免佣百家樂','莊家六點贏半賠，不收佣金','2026-01-03 09:00:00','2026-01-03 09:00:00','2038-01-19 03:14:07'),
	(25,2,'squeezebaccarat','搓牌百家樂','開牌前可搓牌增加緊張感','2026-01-03 11:00:00','2026-01-03 11:00:00','2038-01-19 03:14:07'),
	(26,2,'midibaccarat','迷你百家樂','較小桌面的快速百家樂玩法','2026-01-03 13:00:00','2026-01-03 13:00:00','2038-01-19 03:14:07'),
	(27,3,'frenchroulette','法式輪盤','單零輪盤，含輸一半均分規則','2026-01-03 15:00:00','2026-01-03 15:00:00','2038-01-19 03:14:07'),
	(28,3,'pinballroulette','彈珠輪盤','結合彈珠機制的創新輪盤玩法','2026-01-03 17:00:00','2026-01-03 17:00:00','2038-01-19 03:14:07'),
	(29,1,'spanish21','西班牙21點','去除十點牌的21點變體玩法','2026-01-03 19:00:00','2026-01-03 19:00:00','2038-01-19 03:14:07'),
	(30,1,'doubleexposure','雙開21點','莊家兩張牌都亮示的21點變體','2026-01-03 21:00:00','2026-01-03 21:00:00','2038-01-19 03:14:07'),
	(31,1,'pontoon','英式21點','英式規則的21點變體玩法','2026-01-03 23:00:00','2026-01-03 23:00:00','2038-01-19 03:14:07'),
	(32,1,'omahapoker','奧馬哈撲克','四張底牌加五張公共牌的撲克玩法','2026-01-04 01:00:00','2026-01-04 01:00:00','2038-01-19 03:14:07'),
	(33,1,'shortdeckholdem','短牌德州撲克','去除2到5點牌的高頻德州撲克','2026-01-04 03:00:00','2026-01-04 03:00:00','2038-01-19 03:14:07'),
	(34,1,'ultimateholdem','終極德州撲克','玩家與莊家比牌的德州撲克變體','2026-01-04 05:00:00','2026-01-04 05:00:00','2038-01-19 03:14:07'),
	(35,1,'letitride','放手一搏撲克','三張牌逐步加注的撲克玩法','2026-01-04 07:00:00','2026-01-04 07:00:00','2038-01-19 03:14:07'),
	(36,1,'fourcardpoker','四張牌撲克','用四張牌比牌型的撲克玩法','2026-01-04 09:00:00','2026-01-04 09:00:00','2038-01-19 03:14:07'),
	(37,1,'mississippistud','密西西比梭哈','逐步翻牌加注的撲克玩法','2026-01-04 11:00:00','2026-01-04 11:00:00','2038-01-19 03:14:07'),
	(38,2,'baccaratcowboy','牛仔百家樂','結合牛仔元素的百家樂玩法','2026-01-04 13:00:00','2026-01-04 13:00:00','2038-01-19 03:14:07'),
	(39,4,'supersicbo','超級骰寶','骰寶進階版，含額外倍數獎項','2026-01-04 15:00:00','2026-01-04 15:00:00','2038-01-19 03:14:07'),
	(40,1,'bullbull','鬥牛牛','鬥牛與牛牛結合的比點桌遊','2026-01-04 17:00:00','2026-01-04 17:00:00','2038-01-19 03:14:07'),
	(41,1,'mahjongpair','麻將撲克','用麻將牌型比大小的桌遊','2026-01-04 19:00:00','2026-01-04 19:00:00','2038-01-19 03:14:07'),
	(42,6,'keno','基諾','選號猜中開獎號碼的賓果式遊戲','2026-01-04 21:00:00','2026-01-04 21:00:00','2038-01-19 03:14:07'),
	(43,6,'bingo','賓果','猜號碼連線的傳統賓果遊戲','2026-01-04 23:00:00','2026-01-04 23:00:00','2038-01-19 03:14:07'),
	(44,3,'wheeloffortune','命運之輪','大型轉輪決定倍率的桌遊','2026-01-05 01:00:00','2026-01-05 01:00:00','2038-01-19 03:14:07'),
	(45,3,'moneywheel','財富輪盤','指針停留區域決定賠率的輪盤','2026-01-05 03:00:00','2026-01-05 03:00:00','2038-01-19 03:14:07'),
	(46,1,'redblack','紅黑大戰','猜紅黑花色比點數大小的撲克桌遊','2026-01-05 05:00:00','2026-01-05 05:00:00','2038-01-19 03:14:07'),
	(47,1,'teenpatti','印度三張','印度傳統三張牌比大小玩法','2026-01-05 07:00:00','2026-01-05 07:00:00','2038-01-19 03:14:07'),
	(48,1,'andarbahar','安達巴哈','印度傳統猜牌落點的桌遊','2026-01-05 09:00:00','2026-01-05 09:00:00','2038-01-19 03:14:07'),
	(49,3,'rouletteauto','全自動輪盤','機械自動發球的輪盤遊戲','2026-01-05 11:00:00','2026-01-05 11:00:00','2038-01-19 03:14:07'),
	(50,2,'baccaratlive','真人百家樂','真人荷官現場發牌的百家樂','2026-01-05 13:00:00','2026-01-05 13:00:00','2038-01-19 03:14:07'),
	(51,2,'baccaratvip','百家樂VIP桌','百家樂的高限額 VIP 專屬賭桌','2026-01-05 15:00:00','2026-01-05 15:00:00','2038-01-19 03:14:07'),
	(52,2,'baccarathi','百家樂高額桌','百家樂的高限額投注賭桌','2026-01-05 17:00:00','2026-01-05 17:00:00','2038-01-19 03:14:07'),
	(53,2,'baccaratlo','百家樂新手桌','百家樂的低限額新手入門賭桌','2026-01-05 19:00:00','2026-01-05 19:00:00','2038-01-19 03:14:07'),
	(54,2,'baccarat02','百家樂2號桌','百家樂的第二桌，限額與主桌相同','2026-01-05 21:00:00','2026-01-05 21:00:00','2038-01-19 03:14:07'),
	(55,2,'baccarat03','百家樂3號桌','百家樂的第三桌，限額與主桌相同','2026-01-05 23:00:00','2026-01-05 23:00:00','2038-01-19 03:14:07'),
	(56,2,'luckysixvip','幸運六百家樂VIP桌','幸運六百家樂的高限額 VIP 專屬賭桌','2026-01-06 01:00:00','2026-01-06 01:00:00','2038-01-19 03:14:07'),
	(57,2,'luckysixhi','幸運六百家樂高額桌','幸運六百家樂的高限額投注賭桌','2026-01-06 03:00:00','2026-01-06 03:00:00','2038-01-19 03:14:07'),
	(58,2,'luckysixlo','幸運六百家樂新手桌','幸運六百家樂的低限額新手入門賭桌','2026-01-06 05:00:00','2026-01-06 05:00:00','2038-01-19 03:14:07'),
	(59,2,'luckysix02','幸運六百家樂2號桌','幸運六百家樂的第二桌，限額與主桌相同','2026-01-06 07:00:00','2026-01-06 07:00:00','2038-01-19 03:14:07'),
	(60,2,'luckysix03','幸運六百家樂3號桌','幸運六百家樂的第三桌，限額與主桌相同','2026-01-06 09:00:00','2026-01-06 09:00:00','2038-01-19 03:14:07'),
	(61,2,'dragontigervip','龍虎VIP桌','龍虎的高限額 VIP 專屬賭桌','2026-01-06 11:00:00','2026-01-06 11:00:00','2038-01-19 03:14:07'),
	(62,2,'dragontigerhi','龍虎高額桌','龍虎的高限額投注賭桌','2026-01-06 13:00:00','2026-01-06 13:00:00','2038-01-19 03:14:07'),
	(63,2,'dragontigerlo','龍虎新手桌','龍虎的低限額新手入門賭桌','2026-01-06 15:00:00','2026-01-06 15:00:00','2038-01-19 03:14:07'),
	(64,2,'dragontiger02','龍虎2號桌','龍虎的第二桌，限額與主桌相同','2026-01-06 17:00:00','2026-01-06 17:00:00','2038-01-19 03:14:07'),
	(65,2,'dragontiger03','龍虎3號桌','龍虎的第三桌，限額與主桌相同','2026-01-06 19:00:00','2026-01-06 19:00:00','2038-01-19 03:14:07'),
	(66,2,'speedbaccaratvip','極速百家樂VIP桌','極速百家樂的高限額 VIP 專屬賭桌','2026-01-06 21:00:00','2026-01-06 21:00:00','2038-01-19 03:14:07'),
	(67,2,'speedbaccarathi','極速百家樂高額桌','極速百家樂的高限額投注賭桌','2026-01-06 23:00:00','2026-01-06 23:00:00','2038-01-19 03:14:07'),
	(68,2,'speedbaccaratlo','極速百家樂新手桌','極速百家樂的低限額新手入門賭桌','2026-01-07 01:00:00','2026-01-07 01:00:00','2038-01-19 03:14:07'),
	(69,2,'speedbaccarat02','極速百家樂2號桌','極速百家樂的第二桌，限額與主桌相同','2026-01-07 03:00:00','2026-01-07 03:00:00','2038-01-19 03:14:07'),
	(70,2,'speedbaccarat03','極速百家樂3號桌','極速百家樂的第三桌，限額與主桌相同','2026-01-07 05:00:00','2026-01-07 05:00:00','2038-01-19 03:14:07'),
	(71,2,'baccaratlivevip','真人百家樂VIP桌','真人百家樂的高限額 VIP 專屬賭桌','2026-01-07 07:00:00','2026-01-07 07:00:00','2038-01-19 03:14:07'),
	(72,2,'baccaratlivehi','真人百家樂高額桌','真人百家樂的高限額投注賭桌','2026-01-07 09:00:00','2026-01-07 09:00:00','2038-01-19 03:14:07'),
	(73,2,'baccaratlivelo','真人百家樂新手桌','真人百家樂的低限額新手入門賭桌','2026-01-07 11:00:00','2026-01-07 11:00:00','2038-01-19 03:14:07'),
	(74,2,'baccaratlive02','真人百家樂2號桌','真人百家樂的第二桌，限額與主桌相同','2026-01-07 13:00:00','2026-01-07 13:00:00','2038-01-19 03:14:07'),
	(75,2,'baccaratlive03','真人百家樂3號桌','真人百家樂的第三桌，限額與主桌相同','2026-01-07 15:00:00','2026-01-07 15:00:00','2038-01-19 03:14:07'),
	(76,3,'roulettevip','歐式輪盤VIP桌','歐式輪盤的高限額 VIP 專屬賭桌','2026-01-07 17:00:00','2026-01-07 17:00:00','2038-01-19 03:14:07'),
	(77,3,'roulettehi','歐式輪盤高額桌','歐式輪盤的高限額投注賭桌','2026-01-07 19:00:00','2026-01-07 19:00:00','2038-01-19 03:14:07'),
	(78,3,'roulettelo','歐式輪盤新手桌','歐式輪盤的低限額新手入門賭桌','2026-01-07 21:00:00','2026-01-07 21:00:00','2038-01-19 03:14:07'),
	(79,3,'roulette02','歐式輪盤2號桌','歐式輪盤的第二桌，限額與主桌相同','2026-01-07 23:00:00','2026-01-07 23:00:00','2038-01-19 03:14:07'),
	(80,3,'roulette03','歐式輪盤3號桌','歐式輪盤的第三桌，限額與主桌相同','2026-01-08 01:00:00','2026-01-08 01:00:00','2038-01-19 03:14:07'),
	(81,3,'amrroulettevip','美式輪盤VIP桌','美式輪盤的高限額 VIP 專屬賭桌','2026-01-08 03:00:00','2026-01-08 03:00:00','2038-01-19 03:14:07'),
	(82,3,'amrroulettehi','美式輪盤高額桌','美式輪盤的高限額投注賭桌','2026-01-08 05:00:00','2026-01-08 05:00:00','2038-01-19 03:14:07'),
	(83,3,'amrroulettelo','美式輪盤新手桌','美式輪盤的低限額新手入門賭桌','2026-01-08 07:00:00','2026-01-08 07:00:00','2038-01-19 03:14:07'),
	(84,3,'amrroulette02','美式輪盤2號桌','美式輪盤的第二桌，限額與主桌相同','2026-01-08 09:00:00','2026-01-08 09:00:00','2038-01-19 03:14:07'),
	(85,3,'amrroulette03','美式輪盤3號桌','美式輪盤的第三桌，限額與主桌相同','2026-01-08 11:00:00','2026-01-08 11:00:00','2038-01-19 03:14:07'),
	(86,3,'frenchroulettevip','法式輪盤VIP桌','法式輪盤的高限額 VIP 專屬賭桌','2026-01-08 13:00:00','2026-01-08 13:00:00','2038-01-19 03:14:07'),
	(87,3,'frenchroulettehi','法式輪盤高額桌','法式輪盤的高限額投注賭桌','2026-01-08 15:00:00','2026-01-08 15:00:00','2038-01-19 03:14:07'),
	(88,3,'frenchroulettelo','法式輪盤新手桌','法式輪盤的低限額新手入門賭桌','2026-01-08 17:00:00','2026-01-08 17:00:00','2038-01-19 03:14:07'),
	(89,3,'frenchroulette02','法式輪盤2號桌','法式輪盤的第二桌，限額與主桌相同','2026-01-08 19:00:00','2026-01-08 19:00:00','2038-01-19 03:14:07'),
	(90,3,'frenchroulette03','法式輪盤3號桌','法式輪盤的第三桌，限額與主桌相同','2026-01-08 21:00:00','2026-01-08 21:00:00','2038-01-19 03:14:07'),
	(91,4,'sicbovip','骰寶VIP桌','骰寶的高限額 VIP 專屬賭桌','2026-01-08 23:00:00','2026-01-08 23:00:00','2038-01-19 03:14:07'),
	(92,4,'sicbohi','骰寶高額桌','骰寶的高限額投注賭桌','2026-01-09 01:00:00','2026-01-09 01:00:00','2038-01-19 03:14:07'),
	(93,4,'sicbolo','骰寶新手桌','骰寶的低限額新手入門賭桌','2026-01-09 03:00:00','2026-01-09 03:00:00','2038-01-19 03:14:07'),
	(94,4,'sicbo02','骰寶2號桌','骰寶的第二桌，限額與主桌相同','2026-01-09 05:00:00','2026-01-09 05:00:00','2038-01-19 03:14:07'),
	(95,4,'sicbo03','骰寶3號桌','骰寶的第三桌，限額與主桌相同','2026-01-09 07:00:00','2026-01-09 07:00:00','2038-01-19 03:14:07'),
	(96,4,'crapsvip','花旗骰VIP桌','花旗骰的高限額 VIP 專屬賭桌','2026-01-09 09:00:00','2026-01-09 09:00:00','2038-01-19 03:14:07'),
	(97,4,'crapshi','花旗骰高額桌','花旗骰的高限額投注賭桌','2026-01-09 11:00:00','2026-01-09 11:00:00','2038-01-19 03:14:07'),
	(98,4,'crapslo','花旗骰新手桌','花旗骰的低限額新手入門賭桌','2026-01-09 13:00:00','2026-01-09 13:00:00','2038-01-19 03:14:07'),
	(99,4,'craps02','花旗骰2號桌','花旗骰的第二桌，限額與主桌相同','2026-01-09 15:00:00','2026-01-09 15:00:00','2038-01-19 03:14:07'),
	(100,4,'craps03','花旗骰3號桌','花旗骰的第三桌，限額與主桌相同','2026-01-09 17:00:00','2026-01-09 17:00:00','2038-01-19 03:14:07'),
	(101,1,'blackjackvip','21點VIP桌','21點的高限額 VIP 專屬賭桌','2026-01-09 19:00:00','2026-01-09 19:00:00','2038-01-19 03:14:07'),
	(102,1,'blackjackhi','21點高額桌','21點的高限額投注賭桌','2026-01-09 21:00:00','2026-01-09 21:00:00','2038-01-19 03:14:07'),
	(103,1,'blackjacklo','21點新手桌','21點的低限額新手入門賭桌','2026-01-09 23:00:00','2026-01-09 23:00:00','2038-01-19 03:14:07'),
	(104,1,'blackjack02','21點2號桌','21點的第二桌，限額與主桌相同','2026-01-10 01:00:00','2026-01-10 01:00:00','2038-01-19 03:14:07'),
	(105,1,'blackjack03','21點3號桌','21點的第三桌，限額與主桌相同','2026-01-10 03:00:00','2026-01-10 03:00:00','2038-01-19 03:14:07'),
	(106,1,'texasholdemvip','德州撲克VIP桌','德州撲克的高限額 VIP 專屬賭桌','2026-01-10 05:00:00','2026-01-10 05:00:00','2038-01-19 03:14:07'),
	(107,1,'texasholdemhi','德州撲克高額桌','德州撲克的高限額投注賭桌','2026-01-10 07:00:00','2026-01-10 07:00:00','2038-01-19 03:14:07'),
	(108,1,'texasholdemlo','德州撲克新手桌','德州撲克的低限額新手入門賭桌','2026-01-10 09:00:00','2026-01-10 09:00:00','2038-01-19 03:14:07'),
	(109,1,'texasholdem02','德州撲克2號桌','德州撲克的第二桌，限額與主桌相同','2026-01-10 11:00:00','2026-01-10 11:00:00','2038-01-19 03:14:07'),
	(110,1,'texasholdem03','德州撲克3號桌','德州撲克的第三桌，限額與主桌相同','2026-01-10 13:00:00','2026-01-10 13:00:00','2038-01-19 03:14:07'),
	(111,1,'threecardpokervip','三張牌撲克VIP桌','三張牌撲克的高限額 VIP 專屬賭桌','2026-01-10 15:00:00','2026-01-10 15:00:00','2038-01-19 03:14:07'),
	(112,1,'threecardpokerhi','三張牌撲克高額桌','三張牌撲克的高限額投注賭桌','2026-01-10 17:00:00','2026-01-10 17:00:00','2038-01-19 03:14:07'),
	(113,1,'threecardpokerlo','三張牌撲克新手桌','三張牌撲克的低限額新手入門賭桌','2026-01-10 19:00:00','2026-01-10 19:00:00','2038-01-19 03:14:07'),
	(114,1,'threecardpoker02','三張牌撲克2號桌','三張牌撲克的第二桌，限額與主桌相同','2026-01-10 21:00:00','2026-01-10 21:00:00','2038-01-19 03:14:07'),
	(115,1,'threecardpoker03','三張牌撲克3號桌','三張牌撲克的第三桌，限額與主桌相同','2026-01-10 23:00:00','2026-01-10 23:00:00','2038-01-19 03:14:07'),
	(116,1,'caribbeanstudvip','加勒比撲克VIP桌','加勒比撲克的高限額 VIP 專屬賭桌','2026-01-11 01:00:00','2026-01-11 01:00:00','2038-01-19 03:14:07'),
	(117,1,'caribbeanstudhi','加勒比撲克高額桌','加勒比撲克的高限額投注賭桌','2026-01-11 03:00:00','2026-01-11 03:00:00','2038-01-19 03:14:07'),
	(118,1,'caribbeanstudlo','加勒比撲克新手桌','加勒比撲克的低限額新手入門賭桌','2026-01-11 05:00:00','2026-01-11 05:00:00','2038-01-19 03:14:07'),
	(119,1,'caribbeanstud02','加勒比撲克2號桌','加勒比撲克的第二桌，限額與主桌相同','2026-01-11 07:00:00','2026-01-11 07:00:00','2038-01-19 03:14:07'),
	(120,1,'caribbeanstud03','加勒比撲克3號桌','加勒比撲克的第三桌，限額與主桌相同','2026-01-11 09:00:00','2026-01-11 09:00:00','2038-01-19 03:14:07'),
	(121,1,'niuniuvip','牛牛VIP桌','牛牛的高限額 VIP 專屬賭桌','2026-01-11 11:00:00','2026-01-11 11:00:00','2038-01-19 03:14:07'),
	(122,1,'niuniuhi','牛牛高額桌','牛牛的高限額投注賭桌','2026-01-11 13:00:00','2026-01-11 13:00:00','2038-01-19 03:14:07'),
	(123,1,'niuniulo','牛牛新手桌','牛牛的低限額新手入門賭桌','2026-01-11 15:00:00','2026-01-11 15:00:00','2038-01-19 03:14:07'),
	(124,1,'niuniu02','牛牛2號桌','牛牛的第二桌，限額與主桌相同','2026-01-11 17:00:00','2026-01-11 17:00:00','2038-01-19 03:14:07'),
	(125,1,'niuniu03','牛牛3號桌','牛牛的第三桌，限額與主桌相同','2026-01-11 19:00:00','2026-01-11 19:00:00','2038-01-19 03:14:07'),
	(126,1,'zhajinhuavip','炸金花VIP桌','炸金花的高限額 VIP 專屬賭桌','2026-01-11 21:00:00','2026-01-11 21:00:00','2038-01-19 03:14:07'),
	(127,1,'zhajinhuahi','炸金花高額桌','炸金花的高限額投注賭桌','2026-01-11 23:00:00','2026-01-11 23:00:00','2038-01-19 03:14:07'),
	(128,1,'zhajinhualo','炸金花新手桌','炸金花的低限額新手入門賭桌','2026-01-12 01:00:00','2026-01-12 01:00:00','2038-01-19 03:14:07'),
	(129,1,'zhajinhua02','炸金花2號桌','炸金花的第二桌，限額與主桌相同','2026-01-12 03:00:00','2026-01-12 03:00:00','2038-01-19 03:14:07'),
	(130,1,'zhajinhua03','炸金花3號桌','炸金花的第三桌，限額與主桌相同','2026-01-12 05:00:00','2026-01-12 05:00:00','2038-01-19 03:14:07'),
	(131,1,'studpokervip','梭哈VIP桌','梭哈的高限額 VIP 專屬賭桌','2026-01-12 07:00:00','2026-01-12 07:00:00','2038-01-19 03:14:07'),
	(132,1,'studpokerhi','梭哈高額桌','梭哈的高限額投注賭桌','2026-01-12 09:00:00','2026-01-12 09:00:00','2038-01-19 03:14:07'),
	(133,1,'studpokerlo','梭哈新手桌','梭哈的低限額新手入門賭桌','2026-01-12 11:00:00','2026-01-12 11:00:00','2038-01-19 03:14:07'),
	(134,1,'studpoker02','梭哈2號桌','梭哈的第二桌，限額與主桌相同','2026-01-12 13:00:00','2026-01-12 13:00:00','2038-01-19 03:14:07'),
	(135,1,'studpoker03','梭哈3號桌','梭哈的第三桌，限額與主桌相同','2026-01-12 15:00:00','2026-01-12 15:00:00','2038-01-19 03:14:07'),
	(136,1,'teenpattivip','印度三張VIP桌','印度三張的高限額 VIP 專屬賭桌','2026-01-12 17:00:00','2026-01-12 17:00:00','2038-01-19 03:14:07'),
	(137,1,'teenpattihi','印度三張高額桌','印度三張的高限額投注賭桌','2026-01-12 19:00:00','2026-01-12 19:00:00','2038-01-19 03:14:07'),
	(138,1,'teenpattilo','印度三張新手桌','印度三張的低限額新手入門賭桌','2026-01-12 21:00:00','2026-01-12 21:00:00','2038-01-19 03:14:07'),
	(139,1,'teenpatti02','印度三張2號桌','印度三張的第二桌，限額與主桌相同','2026-01-12 23:00:00','2026-01-12 23:00:00','2038-01-19 03:14:07'),
	(140,1,'teenpatti03','印度三張3號桌','印度三張的第三桌，限額與主桌相同','2026-01-13 01:00:00','2026-01-13 01:00:00','2038-01-19 03:14:07'),
	(141,5,'paigowvip','牌九VIP桌','牌九的高限額 VIP 專屬賭桌','2026-01-13 03:00:00','2026-01-13 03:00:00','2038-01-19 03:14:07'),
	(142,5,'paigowhi','牌九高額桌','牌九的高限額投注賭桌','2026-01-13 05:00:00','2026-01-13 05:00:00','2038-01-19 03:14:07'),
	(143,5,'paigowlo','牌九新手桌','牌九的低限額新手入門賭桌','2026-01-13 07:00:00','2026-01-13 07:00:00','2038-01-19 03:14:07'),
	(144,5,'paigow02','牌九2號桌','牌九的第二桌，限額與主桌相同','2026-01-13 09:00:00','2026-01-13 09:00:00','2038-01-19 03:14:07'),
	(145,5,'paigow03','牌九3號桌','牌九的第三桌，限額與主桌相同','2026-01-13 11:00:00','2026-01-13 11:00:00','2038-01-19 03:14:07'),
	(146,6,'kenovip','基諾VIP桌','基諾的高限額 VIP 專屬賭桌','2026-01-13 13:00:00','2026-01-13 13:00:00','2038-01-19 03:14:07'),
	(147,6,'kenohi','基諾高額桌','基諾的高限額投注賭桌','2026-01-13 15:00:00','2026-01-13 15:00:00','2038-01-19 03:14:07'),
	(148,6,'kenolo','基諾新手桌','基諾的低限額新手入門賭桌','2026-01-13 17:00:00','2026-01-13 17:00:00','2038-01-19 03:14:07'),
	(149,6,'keno02','基諾2號桌','基諾的第二桌，限額與主桌相同','2026-01-13 19:00:00','2026-01-13 19:00:00','2038-01-19 03:14:07'),
	(150,6,'keno03','基諾3號桌','基諾的第三桌，限額與主桌相同','2026-01-13 21:00:00','2026-01-13 21:00:00','2038-01-19 03:14:07'),
	(151,6,'bingovip','賓果VIP桌','賓果的高限額 VIP 專屬賭桌','2026-01-13 23:00:00','2026-01-13 23:00:00','2038-01-19 03:14:07'),
	(152,6,'bingohi','賓果高額桌','賓果的高限額投注賭桌','2026-01-14 01:00:00','2026-01-14 01:00:00','2038-01-19 03:14:07'),
	(153,6,'bingolo','賓果新手桌','賓果的低限額新手入門賭桌','2026-01-14 03:00:00','2026-01-14 03:00:00','2038-01-19 03:14:07'),
	(154,6,'bingo02','賓果2號桌','賓果的第二桌，限額與主桌相同','2026-01-14 05:00:00','2026-01-14 05:00:00','2038-01-19 03:14:07'),
	(155,6,'bingo03','賓果3號桌','賓果的第三桌，限額與主桌相同','2026-01-14 07:00:00','2026-01-14 07:00:00','2038-01-19 03:14:07'),
	(156,7,'fantanvip','番攤VIP桌','番攤的高限額 VIP 專屬賭桌','2026-01-14 09:00:00','2026-01-14 09:00:00','2038-01-19 03:14:07'),
	(157,7,'fantanhi','番攤高額桌','番攤的高限額投注賭桌','2026-01-14 11:00:00','2026-01-14 11:00:00','2038-01-19 03:14:07'),
	(158,7,'fantanlo','番攤新手桌','番攤的低限額新手入門賭桌','2026-01-14 13:00:00','2026-01-14 13:00:00','2038-01-19 03:14:07'),
	(159,7,'fantan02','番攤2號桌','番攤的第二桌，限額與主桌相同','2026-01-14 15:00:00','2026-01-14 15:00:00','2038-01-19 03:14:07'),
	(160,7,'fantan03','番攤3號桌','番攤的第三桌，限額與主桌相同','2026-01-14 17:00:00','2026-01-14 17:00:00','2038-01-19 03:14:07'),
	(167,2,'ABCDER','','我不知道','2026-08-12 21:59:13','2026-08-14 11:40:52','2026-08-14 11:40:52'),
	(182,2,'TEST02111','這是測試名字','desc...','2026-08-12 22:29:58','2026-08-12 22:29:58','2038-01-19 03:14:07'),
	(185,2,'TEST0211p1','這是測試名字','desc...','2026-08-12 23:33:46','2026-08-12 23:33:46','2038-01-19 03:14:07'),
	(189,2,'TEST0211OOp1','這是測試名字','desc...','2026-08-12 23:42:22','2026-08-12 23:42:22','2038-01-19 03:14:07'),
	(193,2,'TEST0211OOrrrrp1','這是測試名字','desc...','2026-08-14 04:48:57','2026-08-14 04:48:57','2038-01-19 03:14:07'),
	(202,2,'TEST0211OOrrrrrrrp1','這是測試名字','desc...','2026-08-14 05:38:49','2026-08-14 05:38:49','2038-01-19 03:14:07'),
	(252,2,'TEST0211OOrroorrrrrp1','這是測試','ABCD','2026-08-16 17:10:25','2026-08-17 07:11:33','2038-01-19 03:14:07'),
	(253,2,'ABVGDG','遊戲','我不知道','2026-08-17 11:00:02','2026-08-17 11:00:02','2038-01-19 03:14:07');

/*!40000 ALTER TABLE `tx-games` ENABLE KEYS */;
UNLOCK TABLES;


# 傾印（Dump）資料表 tx-table_record_logs
# ------------------------------------------------------------

DROP TABLE IF EXISTS `tx-table_record_logs`;

CREATE TABLE `tx-table_record_logs` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `game_id` int unsigned NOT NULL DEFAULT '0',
  `table_record_id` int unsigned NOT NULL DEFAULT '0',
  `state` tinyint NOT NULL DEFAULT '0',
  `text` json NOT NULL,
  `image` json NOT NULL,
  `time` bigint unsigned NOT NULL DEFAULT '0',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  PRIMARY KEY (`id`),
  KEY `tri-gi-s` (`table_record_id`,`game_id`,`state`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;



# 傾印（Dump）資料表 tx-table_records
# ------------------------------------------------------------

DROP TABLE IF EXISTS `tx-table_records`;

CREATE TABLE `tx-table_records` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `no` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '2026-0322-0101-0000-0000-0001' COMMENT '年-月日-桌號-遊戲號-局號-期號',
  `game_id` int unsigned NOT NULL DEFAULT '0',
  `table_id` int unsigned NOT NULL DEFAULT '0',
  `state` tinyint NOT NULL DEFAULT '0',
  `text` json NOT NULL,
  `image` json NOT NULL,
  `result` json NOT NULL,
  `started_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `ended_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  PRIMARY KEY (`id`),
  UNIQUE KEY `n` (`no`),
  KEY `ti-gi-n-da` (`table_id`,`game_id`,`no`,`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;



# 傾印（Dump）資料表 tx-tables
# ------------------------------------------------------------

DROP TABLE IF EXISTS `tx-tables`;

CREATE TABLE `tx-tables` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `no` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '2026-0322-0101-0000-0000-0001' COMMENT '年-月日-桌號-遊戲號-局號-期號',
  `game_id` int unsigned NOT NULL DEFAULT '0',
  `key` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `state` tinyint unsigned NOT NULL DEFAULT '0',
  `description` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `result` json NOT NULL,
  `started_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `ended_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted_at` timestamp NOT NULL DEFAULT '2038-01-19 03:14:07',
  PRIMARY KEY (`id`),
  UNIQUE KEY `key` (`key`),
  KEY `da` (`deleted_at`),
  KEY `n-da` (`no`,`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

LOCK TABLES `tx-tables` WRITE;
/*!40000 ALTER TABLE `tx-tables` DISABLE KEYS */;

INSERT INTO `tx-tables` (`id`, `no`, `game_id`, `key`, `state`, `description`, `result`, `started_at`, `ended_at`, `created_at`, `updated_at`, `deleted_at`)
VALUES
	(1,'2026-0322-0001-0001-0001-0001',1,'tb-001',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:03:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(2,'2026-0322-0002-0002-0001-0001',2,'tb-002',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:06:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(3,'2026-0322-0003-0003-0001-0001',3,'tb-003',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 6, \"player_point\": 3}','2026-03-22 12:09:00','2026-03-22 12:14:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(4,'2026-0322-0004-0023-0001-0001',23,'tb-004',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:12:00','2026-03-22 13:17:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:12:40'),
	(5,'2026-0322-0005-0004-0001-0001',4,'tb-005',0,'輪盤等待開局','{}','2026-03-22 14:15:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(6,'2026-0322-0006-0001-0001-0001',1,'tb-006',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:18:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(7,'2026-0322-0007-0002-0001-0001',2,'tb-007',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:21:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(8,'2026-0322-0008-0003-0001-0001',3,'tb-008',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 2, \"player_point\": 8}','2026-03-22 17:24:00','2026-03-22 17:29:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(9,'2026-0322-0009-0023-0001-0001',23,'tb-009',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:27:00','2026-03-22 18:32:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:27:40'),
	(10,'2026-0322-0010-0004-0001-0001',4,'tb-010',0,'輪盤等待開局','{}','2026-03-22 09:30:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(11,'2026-0322-0011-0001-0001-0001',1,'tb-011',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:33:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(12,'2026-0322-0012-0002-0001-0001',2,'tb-012',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:36:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(13,'2026-0322-0013-0003-0001-0001',3,'tb-013',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 7, \"player_point\": 4}','2026-03-22 12:39:00','2026-03-22 12:44:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(14,'2026-0322-0014-0023-0001-0001',23,'tb-014',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:42:00','2026-03-22 13:47:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:42:40'),
	(15,'2026-0322-0015-0004-0001-0001',4,'tb-015',0,'輪盤等待開局','{}','2026-03-22 14:45:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(16,'2026-0322-0016-0001-0001-0001',1,'tb-016',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:48:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(17,'2026-0322-0017-0002-0001-0001',2,'tb-017',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:51:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(18,'2026-0322-0018-0003-0001-0001',3,'tb-018',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 3, \"player_point\": 0}','2026-03-22 17:54:00','2026-03-22 17:59:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(19,'2026-0322-0019-0023-0001-0001',23,'tb-019',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:57:00','2026-03-22 19:02:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:57:40'),
	(20,'2026-0322-0020-0004-0001-0001',4,'tb-020',0,'輪盤等待開局','{}','2026-03-22 09:00:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(21,'2026-0322-0021-0001-0001-0001',1,'tb-021',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:03:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(22,'2026-0322-0022-0002-0001-0001',2,'tb-022',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:06:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(23,'2026-0322-0023-0003-0001-0001',3,'tb-023',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 8, \"player_point\": 5}','2026-03-22 12:09:00','2026-03-22 12:14:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(24,'2026-0322-0024-0023-0001-0001',23,'tb-024',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:12:00','2026-03-22 13:17:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:12:40'),
	(25,'2026-0322-0025-0004-0001-0001',4,'tb-025',0,'輪盤等待開局','{}','2026-03-22 14:15:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(26,'2026-0322-0026-0001-0001-0001',1,'tb-026',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:18:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(27,'2026-0322-0027-0002-0001-0001',2,'tb-027',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:21:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(28,'2026-0322-0028-0003-0001-0001',3,'tb-028',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 4, \"player_point\": 1}','2026-03-22 17:24:00','2026-03-22 17:29:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(29,'2026-0322-0029-0023-0001-0001',23,'tb-029',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:27:00','2026-03-22 18:32:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:27:40'),
	(30,'2026-0322-0030-0004-0001-0001',4,'tb-030',0,'輪盤等待開局','{}','2026-03-22 09:30:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(31,'2026-0322-0031-0001-0001-0001',1,'tb-031',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:33:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(32,'2026-0322-0032-0002-0001-0001',2,'tb-032',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:36:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(33,'2026-0322-0033-0003-0001-0001',3,'tb-033',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 0, \"player_point\": 6}','2026-03-22 12:39:00','2026-03-22 12:44:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(34,'2026-0322-0034-0023-0001-0001',23,'tb-034',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:42:00','2026-03-22 13:47:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:42:40'),
	(35,'2026-0322-0035-0004-0001-0001',4,'tb-035',0,'輪盤等待開局','{}','2026-03-22 14:45:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(36,'2026-0322-0036-0001-0001-0001',1,'tb-036',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:48:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(37,'2026-0322-0037-0002-0001-0001',2,'tb-037',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:51:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(38,'2026-0322-0038-0003-0001-0001',3,'tb-038',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 5, \"player_point\": 2}','2026-03-22 17:54:00','2026-03-22 17:59:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(39,'2026-0322-0039-0023-0001-0001',23,'tb-039',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:57:00','2026-03-22 19:02:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:57:40'),
	(40,'2026-0322-0040-0004-0001-0001',4,'tb-040',0,'輪盤等待開局','{}','2026-03-22 09:00:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(41,'2026-0322-0041-0001-0001-0001',1,'tb-041',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:03:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(42,'2026-0322-0042-0002-0001-0001',2,'tb-042',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:06:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(43,'2026-0322-0043-0003-0001-0001',3,'tb-043',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 1, \"player_point\": 7}','2026-03-22 12:09:00','2026-03-22 12:14:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(44,'2026-0322-0044-0023-0001-0001',23,'tb-044',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:12:00','2026-03-22 13:17:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:12:40'),
	(45,'2026-0322-0045-0004-0001-0001',4,'tb-045',0,'輪盤等待開局','{}','2026-03-22 14:15:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(46,'2026-0322-0046-0001-0001-0001',1,'tb-046',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:18:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(47,'2026-0322-0047-0002-0001-0001',2,'tb-047',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:21:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(48,'2026-0322-0048-0003-0001-0001',3,'tb-048',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 6, \"player_point\": 3}','2026-03-22 17:24:00','2026-03-22 17:29:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(49,'2026-0322-0049-0023-0001-0001',23,'tb-049',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:27:00','2026-03-22 18:32:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:27:40'),
	(50,'2026-0322-0050-0004-0001-0001',4,'tb-050',0,'輪盤等待開局','{}','2026-03-22 09:30:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(51,'2026-0322-0051-0001-0001-0001',1,'tb-051',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:33:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(52,'2026-0322-0052-0002-0001-0001',2,'tb-052',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:36:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(53,'2026-0322-0053-0003-0001-0001',3,'tb-053',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 2, \"player_point\": 8}','2026-03-22 12:39:00','2026-03-22 12:44:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(54,'2026-0322-0054-0023-0001-0001',23,'tb-054',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:42:00','2026-03-22 13:47:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:42:40'),
	(55,'2026-0322-0055-0004-0001-0001',4,'tb-055',0,'輪盤等待開局','{}','2026-03-22 14:45:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(56,'2026-0322-0056-0001-0001-0001',1,'tb-056',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:48:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(57,'2026-0322-0057-0002-0001-0001',2,'tb-057',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:51:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(58,'2026-0322-0058-0003-0001-0001',3,'tb-058',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 7, \"player_point\": 4}','2026-03-22 17:54:00','2026-03-22 17:59:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(59,'2026-0322-0059-0023-0001-0001',23,'tb-059',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:57:00','2026-03-22 19:02:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:57:40'),
	(60,'2026-0322-0060-0004-0001-0001',4,'tb-060',0,'輪盤等待開局','{}','2026-03-22 09:00:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(61,'2026-0322-0061-0001-0001-0001',1,'tb-061',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:03:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(62,'2026-0322-0062-0002-0001-0001',2,'tb-062',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:06:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(63,'2026-0322-0063-0003-0001-0001',3,'tb-063',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 3, \"player_point\": 0}','2026-03-22 12:09:00','2026-03-22 12:14:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(64,'2026-0322-0064-0023-0001-0001',23,'tb-064',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:12:00','2026-03-22 13:17:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:12:40'),
	(65,'2026-0322-0065-0004-0001-0001',4,'tb-065',0,'輪盤等待開局','{}','2026-03-22 14:15:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(66,'2026-0322-0066-0001-0001-0001',1,'tb-066',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:18:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(67,'2026-0322-0067-0002-0001-0001',2,'tb-067',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:21:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(68,'2026-0322-0068-0003-0001-0001',3,'tb-068',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 8, \"player_point\": 5}','2026-03-22 17:24:00','2026-03-22 17:29:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(69,'2026-0322-0069-0023-0001-0001',23,'tb-069',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:27:00','2026-03-22 18:32:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:27:40'),
	(70,'2026-0322-0070-0004-0001-0001',4,'tb-070',0,'輪盤等待開局','{}','2026-03-22 09:30:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(71,'2026-0322-0071-0001-0001-0001',1,'tb-071',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:33:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(72,'2026-0322-0072-0002-0001-0001',2,'tb-072',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:36:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(73,'2026-0322-0073-0003-0001-0001',3,'tb-073',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 4, \"player_point\": 1}','2026-03-22 12:39:00','2026-03-22 12:44:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(74,'2026-0322-0074-0023-0001-0001',23,'tb-074',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:42:00','2026-03-22 13:47:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:42:40'),
	(75,'2026-0322-0075-0004-0001-0001',4,'tb-075',0,'輪盤等待開局','{}','2026-03-22 14:45:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(76,'2026-0322-0076-0001-0001-0001',1,'tb-076',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:48:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(77,'2026-0322-0077-0002-0001-0001',2,'tb-077',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:51:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(78,'2026-0322-0078-0003-0001-0001',3,'tb-078',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 0, \"player_point\": 6}','2026-03-22 17:54:00','2026-03-22 17:59:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(79,'2026-0322-0079-0023-0001-0001',23,'tb-079',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:57:00','2026-03-22 19:02:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:57:40'),
	(80,'2026-0322-0080-0004-0001-0001',4,'tb-080',0,'輪盤等待開局','{}','2026-03-22 09:00:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(81,'2026-0322-0081-0001-0001-0001',1,'tb-081',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:03:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(82,'2026-0322-0082-0002-0001-0001',2,'tb-082',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:06:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(83,'2026-0322-0083-0003-0001-0001',3,'tb-083',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 5, \"player_point\": 2}','2026-03-22 12:09:00','2026-03-22 12:14:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(84,'2026-0322-0084-0023-0001-0001',23,'tb-084',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:12:00','2026-03-22 13:17:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:12:40'),
	(85,'2026-0322-0085-0004-0001-0001',4,'tb-085',0,'輪盤等待開局','{}','2026-03-22 14:15:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(86,'2026-0322-0086-0001-0001-0001',1,'tb-086',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:18:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(87,'2026-0322-0087-0002-0001-0001',2,'tb-087',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:21:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(88,'2026-0322-0088-0003-0001-0001',3,'tb-088',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 1, \"player_point\": 7}','2026-03-22 17:24:00','2026-03-22 17:29:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(89,'2026-0322-0089-0023-0001-0001',23,'tb-089',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:27:00','2026-03-22 18:32:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:27:40'),
	(90,'2026-0322-0090-0004-0001-0001',4,'tb-090',0,'輪盤等待開局','{}','2026-03-22 09:30:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(91,'2026-0322-0091-0001-0001-0001',1,'tb-091',1,'百家樂下注中','{\"winner\": null}','2026-03-22 10:33:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(92,'2026-0322-0092-0002-0001-0001',2,'tb-092',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 11:36:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(93,'2026-0322-0093-0003-0001-0001',3,'tb-093',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 6, \"player_point\": 3}','2026-03-22 12:39:00','2026-03-22 12:44:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(94,'2026-0322-0094-0023-0001-0001',23,'tb-094',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 13:42:00','2026-03-22 13:47:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 13:42:40'),
	(95,'2026-0322-0095-0004-0001-0001',4,'tb-095',0,'輪盤等待開局','{}','2026-03-22 14:45:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(96,'2026-0322-0096-0001-0001-0001',1,'tb-096',1,'百家樂下注中','{\"winner\": null}','2026-03-22 15:48:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(97,'2026-0322-0097-0002-0001-0001',2,'tb-097',2,'龍虎鬥開牌中','{\"winner\": null}','2026-03-22 16:51:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(98,'2026-0322-0098-0003-0001-0001',3,'tb-098',3,'骰寶已結算','{\"winner\": \"banker\", \"banker_point\": 2, \"player_point\": 8}','2026-03-22 17:54:00','2026-03-22 17:59:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(99,'2026-0322-0099-0023-0001-0001',23,'tb-099',4,'極速百家樂已作廢','{\"reason\": \"系統異常\", \"cancelled\": true}','2026-03-22 18:57:00','2026-03-22 19:02:32','2026-08-12 21:05:45','2026-08-12 21:05:45','2026-03-22 18:57:40'),
	(100,'2026-0322-0100-0004-0001-0001',4,'tb-100',0,'輪盤等待開局','{}','2026-03-22 09:00:00','2038-01-19 03:14:07','2026-08-12 21:05:45','2026-08-12 21:05:45','2038-01-19 03:14:07'),
	(101,'2026-0322-0101-0000-0000-0001',2,'tb-101',2,'','[]','2026-08-14 14:33:29','2038-01-19 03:14:07','2026-08-14 14:33:29','2026-08-14 14:33:29','2038-01-19 03:14:07');

/*!40000 ALTER TABLE `tx-tables` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
